import React from "react";
import Link from "next/link";
import More from "../More";

function PromotionCard({ image, link }) {
  return (
    <article className="promotion-card">
      <Link href="/promotions/[link]" as={"/promotions/" + link}>
        <div className="promotion-card__image">
          <img src={image} alt="" />
        </div>
        <div className="promotion-card__more">
          Подробнее
          <span>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="20"
              height="20"
              viewBox="0 0 20 20"
              fill="none"
            >
              <path
                d="M7.6603 5.8564C7.50509 6.01253 7.41797 6.22374 7.41797 6.4439C7.41797 6.66405 7.50509 6.87526 7.6603 7.0314L10.6103 10.0231L7.6603 12.9731C7.50509 13.1292 7.41797 13.3404 7.41797 13.5606C7.41797 13.7807 7.50509 13.9919 7.6603 14.1481C7.73776 14.2262 7.82993 14.2882 7.93148 14.3305C8.03303 14.3728 8.14195 14.3946 8.25196 14.3946C8.36197 14.3946 8.47089 14.3728 8.57244 14.3305C8.67399 14.2882 8.76616 14.2262 8.84363 14.1481L12.377 10.6147C12.4551 10.5373 12.5171 10.4451 12.5594 10.3435C12.6017 10.242 12.6235 10.1331 12.6235 10.0231C12.6235 9.91305 12.6017 9.80413 12.5594 9.70258C12.5171 9.60103 12.4551 9.50887 12.377 9.4314L8.84363 5.8564C8.76616 5.77829 8.67399 5.7163 8.57244 5.67399C8.47089 5.63168 8.36197 5.6099 8.25196 5.6099C8.14195 5.6099 8.03303 5.63168 7.93148 5.67399C7.82993 5.7163 7.73776 5.77829 7.6603 5.8564Z"
                fill="#212121"
              />
            </svg>
          </span>
        </div>
      </Link>
    </article>
  );
}

export default PromotionCard;
